src/InformationRegisters/СохранениеВводимыхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СохранениеВводимыхЗначений</Name>
			<Comment>Регистр хранит историю вводимых значений пользователями</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПоля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/СохранениеВводимыхЗначений/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЯВЛЯЮЩИЕСЯ ОБЕРТКАМИ И РАСШИРЕНИЯМИ ДЛЯ БАЗОВЫХ ФУНКЦИЙ МЕХАНИЗМА

#Область СлужебныеПроцедурыИФункции

// Заполняет списки выбора элементов форм считывая сохраненные 
// 
// Параметры
// ЭтаФорма      - УправляемаяФорма - форма, на элементы которой, навешивается механизм
// ЭлементыСЗначениями - специально сформированная таблица значений
//                 содержащая сведения с именами элементов и их текущими значениями
// ДополнительнаяИдентификация - строка - дополнительная идентификация, необходимая
//                 для поддержки уникальности адресации элементов\
//
Процедура ПодключитьЭлементКИсторииВвода(знач ЭтаФорма, знач ЭлементФормы,Сотрудник = Неопределено,ПодключитьОбработчикРедактированияИстории = Ложь) Экспорт
	
	ИдентификаторПоля = "";
	Если ТипЗнч(ЭтаФорма) = Тип("Строка") И ТипЗнч(ЭлементФормы) = Тип("Строка") Тогда
        ИдентификаторПоля = ЭтаФорма + ЭлементФормы;
	Иначе
		ИдентификаторПоля = ЭтаФорма.ИмяФормы + ЭлементФормы.Имя;
	КонецЕсли;	
	
	// Получаем историю ввода для элемента
	СписокИсторииВвода = ПрочитатьМассивЗначенийИсторииВвода(ИдентификаторПоля,?(ЗначениеЗаполнено(Сотрудник),Сотрудник,ПараметрыСеанса.ТекущийПользователь.Сотрудник));
	
	Если СписокИсторииВвода <> Неопределено Тогда
		
		ЭлементФормы.КнопкаСпискаВыбора = ?(СписокИсторииВвода.Количество() > 0, Истина, Ложь);
		// Подклбчение обработчика редактрирования значений истории ввода
		Если ПодключитьОбработчикРедактированияИстории Тогда
			
			ЭлементФормы.КнопкаВыбора       = Истина;			
			ЭлементФормы.УстановитьДействие("НачалоВыбора","Подключаемый_ОбработчикКэшЛист");
			
		КонецЕсли;
		
		// Заполнение списка элемента значениями истории ввода
		ЭлементФормы.СписокВыбора.Очистить();
		Для Каждого ЭлементСпискаИсторииВыбора Из СписокИсторииВвода Цикл
			
			НовыйЭлемент          = ЭлементФормы.СписокВыбора.Добавить();
			НовыйЭлемент.Значение = ЭлементСпискаИсторииВыбора.Значение;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

// Заполняет списки выбора элементов форм считывая сохраненные 
// 
// Параметры
// ЭтаФорма      - УправляемаяФорма - форма, на элементы которой, навешивается механизм
// ЭлементыСЗначениями - специально сформированная таблица значений
//                 содержащая сведения с именами элементов и их текущими значениями
// ДополнительнаяИдентификация - строка - дополнительная идентификация, необходимая
//                 для поддержки уникальности адресации элементов\
//
Процедура ПодключитьЭлементыКИсторииВвода(знач ЭтаФорма,знач ЭлементыСЗначениями,Сотрудник = Неопределено,ПодключитьОбработчикРедактированияИстории = Ложь) Экспорт
	
	Для Каждого ЭлементТЗ Из ЭлементыСЗначениями Цикл
		ПодключитьЭлементКИсторииВвода(ЭтаФорма,ЭлементТЗ,Сотрудник,ПодключитьОбработчикРедактированияИстории);
	КонецЦикла; 
	
КонецПроцедуры

// Обновляет информацию по истории выбора новым значением, а так же
// обновляет список выбора по всем элементам
//
// Параметры
// ЭтаФорма      - УправляемаяФорма - форма, на элементы которой, навешивается механизм
// ЭлементыСЗначениями - специально сформированная таблица значений
//                 содержащая сведения с именами элементов и их текущими значениями
// ДополнительнаяИдентификация - строка - дополнительная идентификация, необходимая
//                 для поддержки уникальности адресации элементов\
//
Процедура ЗаписатьЗначениеВИсториюВвода(знач ЭтаФорма,знач ЭлементФормы,Сотрудник = Неопределено,знач ЗначениеРеквизита,СмиволРзделительФраз = Неопределено,ПереподключитьЭлементФормы = ЛОжь) Экспорт
	
	СотрудникОтбора = ?(ЗначениеЗаполнено(Сотрудник),Сотрудник,ПараметрыСеанса.ТекущийПользователь.Сотрудник);
	
	// Если передан текст требующий разбиения по фразам
	МассивПодстрок = Новый Массив;                                           
	Если ЗначениеЗаполнено(СмиволРзделительФраз) Тогда		
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЗначениеРеквизита,СмиволРзделительФраз);
	Иначе
		МассивПодстрок.Добавить(ЗначениеРеквизита);
	КонецЕсли;
	
	ИдентификаторПоля = "";
	Если ТипЗнч(ЭтаФорма) = Тип("Строка") И ТипЗнч(ЭлементФормы) = Тип("Строка") Тогда
        ИдентификаторПоля = ЭтаФорма + ЭлементФормы;
	Иначе
		ИдентификаторПоля = ЭтаФорма.ИмяФормы + ЭлементФормы.Имя;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.СохранениеВводимыхЗначений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Значение              = СотрудникОтбора;
	НаборЗаписей.Отбор.Сотрудник.Использование         = Истина;
    НаборЗаписей.Отбор.ИдентификаторПоля.Значение      = ИдентификаторПоля;
	НаборЗаписей.Отбор.ИдентификаторПоля.Использование = Истина;
    	
    ПроверочныеДанные = НаборЗаписей.ВыгрузитьКолонку("Значение");
	
	// Добавляем новые значения в набор
	Для Каждого ЭлМассива ИЗ МассивПодстрок Цикл
		
		ЭлМассива = СокрЛП(ЭлМассива);
	    // Приведение первого символа к верхнему регистру
		Если СтрДлина(ЭлМассива) >1 Тогда
			ЭлМассива  = ВРег(Лев(ЭлМассива ,1)) + Прав(ЭлМассива,СтрДлина(ЭлМассива) - 1);
		КонецЕсли;

		НаборЗаписей.Отбор.Значение.Значение      = ЭлМассива;
	    НаборЗаписей.Отбор.Значение.Использование = Истина;
        НаборЗаписей.Прочитать();
		
		// Проверка наличия существующей записи
		Если НаборЗаписей.Количество() = 0 Тогда
			
			НоваяЗапись                   = РегистрыСведений.СохранениеВводимыхЗначений.СоздатьМенеджерЗаписи();
			НоваяЗапись.Сотрудник         = СотрудникОтбора;
			НоваяЗапись.ИдентификаторПоля = ИдентификаторПоля;
			НоваяЗапись.Значение          = ЭлМассива;
			НоваяЗапись.Записать(Истина);
			
		КонецЕсли;	
		
			
	КонецЦикла;
	
	// Переподключение элемента ввода при необходимости
	Если ПереподключитьЭлементФормы Тогда
		ПодключитьЭлементКИсторииВвода(ЭтаФорма,ЭлементФормы);
	КонецЕсли;
	
КонецПроцедуры

// Обновляет информацию по истории выбора новым значением, а так же
// обновляет список выбора по всем элементам
//
// Параметры
// ЭтаФорма      - УправляемаяФорма - форма, на элементы которой, навешивается механизм
// ЭлементыСЗначениями - специально сформированная таблица значений
//                 содержащая сведения с именами элементов и их текущими значениями
// ДополнительнаяИдентификация - строка - дополнительная идентификация, необходимая
//                 для поддержки уникальности адресации элементов\
//
Процедура ЗаписатьЗначенияВИсториюВвода(знач ЭтаФорма, МассивЭлементовИИхЗначений,Сотрудник = Неопределено,ПереподключитьЭлементФормы = ЛОжь) Экспорт
	
	Для Каждого ЭлМассива Из МассивЭлементовИИхЗначений Цикл
		ЗаписатьЗначениеВИсториюВвода(ЭтаФорма,ЭлМассива.Элемент,Сотрудник,ЭлМассива.Значение,,ПереподключитьЭлементФормы);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает список ранее введеных значений. В качестве ссылки на пользователя
// берется значение ПараметрСеанса.ТекущийПользователь
// 
// Параметры:
// Идентификатор - Строка - идентификатор элемента, по которому необходимо вернуть
//                 спискок вводимых значений
// Возвращаемое значение:
// СписокЗначений - список из значений истории ввода
//
Функция ПрочитатьМассивЗначенийИсторииВвода(знач ЭтаФорма,знач ЭлементФормы,Сотрудник = Неопределено,ДляВсехСотрудников = Ложь,ПодстрокаФильтра = Неопределено) Экспорт
	
	Если ТипЗнч(ЭтаФорма) = Тип("Строка") И ТипЗнч(ЭлементФормы) = Тип("Строка") Тогда
		ИдентификаторПоля = ЭтаФорма + ЭлементФормы;
	Иначе
		ИдентификаторПоля = ЭтаФорма.ИмяФормы + ЭлементФормы.Имя;
	КонецЕсли;
	
	ЗапросСписка = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СохранениеВводимыхЗначений.Значение
	|ИЗ
	|	РегистрСведений.СохранениеВводимыхЗначений КАК СохранениеВводимыхЗначений
	|ГДЕ
	|	СохранениеВводимыхЗначений.ИдентификаторПоля = &ИдентификаторПоля
	|	И ВЫБОР
	|			КОГДА &Сотрудник <> НЕОПРЕДЕЛЕНО
	|				ТОГДА СохранениеВводимыхЗначений.Сотрудник = &Сотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И (&ПодстрокаОтбора = НЕОПРЕДЕЛЕНО ИЛИ СохранениеВводимыхЗначений.Значение ПОДОБНО &ПодстрокаОтбора)
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	ЗапросСписка.УстановитьПараметр("ИдентификаторПоля",ИдентификаторПоля);
	ЗапросСписка.УстановитьПараметр("Сотрудник"        ,?(ДляВсехСотрудников ИЛИ  НЕ ЗначениеЗаполнено(Сотрудник), Неопределено, Сотрудник));
	ЗапросСписка.УстановитьПараметр("ПодстрокаОтбора"  ,?(ЗначениеЗаполнено(ПодстрокаФильтра), ПодстрокаФильтра + "%","%"));
	
	МассивЗначений = ЗапросСписка.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");

	Возврат МассивЗначений;
	
КонецФункции

// Удалить значение из истории ввода
Процедура УдалитьЗначениеИзИсторииВвода(знач ЭтаФорма,знач ЭлементФормы,Сотрудник = Неопределено,Знач Значение) Экспорт
	
	Если ТипЗнч(ЭтаФорма) = Тип("Строка") И ТипЗнч(ЭлементФормы) = Тип("Строка") Тогда
		ИдентификаторПоля = ЭтаФорма + ЭлементФормы;
	Иначе
		ИдентификаторПоля = ЭтаФорма.ИмяФормы + ЭлементФормы.Имя;
	КонецЕсли;
	
    СотрудникОтбора = ?(ЗначениеЗаполнено(Сотрудник),Сотрудник,ПараметрыСеанса.ТекущийПользователь.Сотрудник);
	
	НаборЗаписей = РегистрыСведений.СохранениеВводимыхЗначений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Значение              = СотрудникОтбора;
	НаборЗаписей.Отбор.Сотрудник.Использование         = Истина;
    НаборЗаписей.Отбор.ИдентификаторПоля.Значение      = ИдентификаторПоля;
	НаборЗаписей.Отбор.ИдентификаторПоля.Использование = Истина;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Значение = СокрЛП(Значение);
		// Приведение первого символа к верхнему регистру
		Если СтрДлина(Значение) >1 Тогда
			Значение  = ВРег(Лев(Значение ,1)) + Прав(Значение,СтрДлина(Значение) - 1);
		КонецЕсли;
		
		НаборЗаписей.Отбор.Значение.Значение               = Значение;
		НаборЗаписей.Отбор.Значение.Использование          = Истина;
		
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры


// Обновляет информацию по истории выбора новым значением, а так же
// обновляет список выбора по всем элементам
//
// Параметры
// ЭтаФорма      - УправляемаяФорма - форма, на элементы которой, навешивается механизм
// ЭлементыСЗначениями - специально сформированная таблица значений
//                 содержащая сведения с именами элементов и их текущими значениями
// ДополнительнаяИдентификация - строка - дополнительная идентификация, необходимая
//                 для поддержки уникальности адресации элементов\
//
Процедура ОбновитьСпискиВыбора(знач ЭтаФорма,
                               знач СохраняемыеЭлементы,
                               знач ДополнительнаяИдентификация = "") Экспорт
	
	Префикс = ?(ЗначениеЗаполнено(ДополнительнаяИдентификация), ДополнительнаяИдентификация + ".", "");
	
	Для Каждого ЭлементТаблицы Из СохраняемыеЭлементы Цикл
		Если ЗначениеЗаполнено(ЭлементТаблицы.ЗначениеРеквизита) Тогда
			ДобавитьЗначениеВИсториюВвода(
			              Префикс+ЭлементТаблицы.ИмяПоляЭлемента,
			              ЭлементТаблицы.ЗначениеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьСписокВыбора(ЭтаФорма, СохраняемыеЭлементы, ДополнительнаяИдентификация);
	
КонецПроцедуры

// Добавляет значение для истории ввода по идентификатору в конец списка
// Если запись уже существует - она переносится в конец
// Если записей больше чем 15 то первая запись удаляется
//
// Параметры:
// Идентификатор - Строка - идентификатор по которому будет вестись история ввода
// Значение      - значение добавляемое к истории
//
Процедура ДобавитьЗначениеВИсториюВвода(Идентификатор, Значение) Экспорт
	
	МассивВведенныхЗначений = ПолучитьНастройкуСистемногоХранилища(Идентификатор,"МеханизмСохраненияПоследнихВыбранныхЗначений");
	
	Если МассивВведенныхЗначений = Неопределено Тогда
		МассивВведенныхЗначений = Новый Массив;
	КонецЕсли;
	
	Для Индекс = 0 по МассивВведенныхЗначений.ВГраница() Цикл
		Если МассивВведенныхЗначений.Получить(Индекс) = Значение Тогда
			МассивВведенныхЗначений.Удалить(Индекс);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	МассивВведенныхЗначений.Вставить(0, Значение);
	Если Идентификатор = "ОбщаяФорма.РедактированиеНовогоПисьма.ЭлектронныйАдресКому"  Тогда 
		Сч = 5;
	Иначе
		Сч = 15;
	КонецЕсли;
	Пока МассивВведенныхЗначений.Количество() > Сч Цикл
		МассивВведенныхЗначений.Удалить(МассивВведенныхЗначений.ВГраница());
	КонецЦикла;
	
	СохранитьНастройкуСистемногоХранилища(Идентификатор, МассивВведенныхЗначений, "МеханизмСохраненияПоследнихВыбранныхЗначений");
	
КонецПроцедуры

// Функция формирует таблицу значений с наименованиями элементов формы
// и их значениями по переданной структуре. Передаваемая структура
// должна содержать соответствия ключ - имя поля, значение - значение
// реквизита формы, связанное с этим полем.
//
Функция СформироватьТаблицуСохраненяемыхЭлементов(знач СохраняемыеЭлементы) Экспорт
	
	СписокСохраняемыхПолей = Новый ТаблицаЗначений;
	СписокСохраняемыхПолей.Колонки.Добавить("ИмяПоляЭлемента");
	СписокСохраняемыхПолей.Колонки.Добавить("ЗначениеРеквизита");
	
	Для Каждого СохраняемыйЭлемент Из СохраняемыеЭлементы Цикл
		
		НоваяСтрока = СписокСохраняемыхПолей.Добавить();
		НоваяСтрока.ИмяПоляЭлемента = СохраняемыйЭлемент.Ключ;
		НоваяСтрока.ЗначениеРеквизита = СохраняемыйЭлемент.Значение;
		
	КонецЦикла;
	
	Возврат СписокСохраняемыхПолей;
	
КонецФункции

// Заполняет списки выбора элементов форм считывая сохраненные 
// 
// Параметры
// ЭтаФорма      - УправляемаяФорма - форма, на элементы которой, навешивается механизм
// ЭлементыСЗначениями - специально сформированная таблица значений
//                 содержащая сведения с именами элементов и их текущими значениями
// ДополнительнаяИдентификация - строка - дополнительная идентификация, необходимая
//                 для поддержки уникальности адресации элементов\
//
Процедура ЗаполнитьСписокВыбора(ЭтаФорма,
                                знач ЭлементыСЗначениями,
                                знач ДополнительнаяИдентификация = "") Экспорт
	
	Элементы = ЭтаФорма.Элементы;
	
	Префикс = ?(ЗначениеЗаполнено(ДополнительнаяИдентификация), ДополнительнаяИдентификация + ".", "");
	
	Для Каждого ЭлементТЗ Из ЭлементыСЗначениями Цикл
		
		НаименованиеЭлементаФормы = ЭлементТЗ.ИмяПоляЭлемента;
		
		Если ЗначениеЗаполнено(НаименованиеЭлементаФормы) Тогда
			
			СписокИсторииВвода = ПолучитьСписокЗначенийИсторииВвода(Префикс+ЭлементТЗ.ИмяПоляЭлемента);
			
			Если СписокИсторииВвода <> Неопределено Тогда
				
				ПолеФормы = Элементы.Найти(НаименованиеЭлементаФормы);
				
				СписокВыбора                 = ПолеФормы.СписокВыбора;		
				ПолеФормы.КнопкаСпискаВыбора = ?(СписокИсторииВвода.Количество() > 0, Истина, Ложь);
				
				Если ТипЗнч(ЭлементТЗ.ЗначениеРеквизита) = Тип("Строка") И СписокИсторииВвода.Количество() > 0 Тогда
					
					ПолеФормы.КнопкаВыбора       = Истина;	
					ПолеФормы.УстановитьДействие("НачалоВыбора","Подключаемый_ОбработчикКэшЛист");
					
				КонецЕсли;
				
				СписокВыбора.Очистить();
				Для Каждого ЭлементСпискаИсторииВыбора Из СписокИсторииВвода Цикл
					
					НовыйЭлемент = СписокВыбора.Добавить();
					НовыйЭлемент.Значение = ЭлементСпискаИсторииВыбора.Значение;
					
				КонецЦикла;
			КонецЕсли; // СписокИсторииВвода <> Неопределено
		КонецЕсли; // ЗначениеЗаполнено(НаименованиеЭлементаФормы)
	КонецЦикла; // Для Каждого ЭлементТЗ Из ЭлементыСЗначениями Цикл
	
КонецПроцедуры

// Возвращает список ранее введеных значений. В качестве ссылки на пользователя
// берется значение ПараметрСеанса.ТекущийПользователь
// 
// Параметры:
// Идентификатор - Строка - идентификатор элемента, по которому необходимо вернуть
//                 спискок вводимых значений
// Возвращаемое значение:
// СписокЗначений - список из значений истории ввода
//
Функция ПолучитьСписокЗначенийИсторииВвода(Идентификатор) Экспорт
	
	МассивВведенныхЗначений = ПолучитьНастройкуСистемногоХранилища(Идентификатор,"МеханизмСохраненияПоследнихВыбранныхЗначений");
	
	Если МассивВведенныхЗначений = Неопределено Тогда
		МассивВведенныхЗначений = Новый Массив;
	КонецЕсли;
	
	СписокИстории = Новый СписокЗначений;
	
	Для Индекс = 0 по МассивВведенныхЗначений.ВГраница() Цикл
		СписокИстории.Добавить(МассивВведенныхЗначений.Получить(Индекс));
	КонецЦикла;
	
	Возврат СписокИстории;
	
КонецФункции

// Добавляет значение для истории ввода по идентификатору в конец списка
// Если запись уже существует - она переносится в конец
// Если записей больше чем 15 то первая запись удаляется
//
// Параметры:
// Идентификатор - Строка - идентификатор по которому будет вестись история ввода
// Значение      - значение добавляемое к истории
//
Процедура ДобавитьЗначениеВИсториюВводаХранилища(Идентификатор, Значение,ЛимитКоличестваЗначений = 0) Экспорт
	
	// Если элемент уже содержится в истории
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
        Возврат;
	КонецЕсли;	

	
	
	МассивВведенныхЗначений = ПолучитьНастройкуСистемногоХранилища(Идентификатор,"МеханизмСохраненияПоследнихВыбранныхЗначений");
	
	Если МассивВведенныхЗначений = Неопределено Тогда
		МассивВведенныхЗначений = Новый Массив;
	КонецЕсли;
	
	// Если элемент уже содержится в истории
	Если МассивВведенныхЗначений.Найти(НРег(Значение)) <> Неопределено Тогда
        Возврат;
	КонецЕсли;	
	
	МассивВведенныхЗначений.Вставить(0, НРег(Значение));
	
	// Если указан лимит количества значений в истории для этого элемента 
	Если ЛимитКоличестваЗначений > 0 Тогда
		Пока МассивВведенныхЗначений.Количество() > ЛимитКоличестваЗначений Цикл
			МассивВведенныхЗначений.Удалить(МассивВведенныхЗначений.ВГраница());
		КонецЦикла;
	КонецЕсли;
	
	СохранитьНастройкуСистемногоХранилища(Идентификатор, МассивВведенныхЗначений, "МеханизмСохраненияПоследнихВыбранныхЗначений");
	
КонецПроцедуры

// Сохраняет настройку в системное хранилище
//
Функция СохранитьНастройкуСистемногоХранилища(знач КлючОбъекта,
                                              знач Настройка,
                                              знач КлючНастроек = Неопределено,
                                              знач ОписаниеНастроек = Неопределено,
                                              знач ИдентификаторПользователя = Неопределено) Экспорт
	
											  УстановитьПривилегированныйРежим(Истина);
											  ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта, КлючНастроек, Настройка, ОписаниеНастроек, ИдентификаторПользователя);
											  УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

// Получает настройку из системного хранилища
//
Функция ПолучитьНастройкуСистемногоХранилища(знач КлючОбъекта,
                                             знач КлючНастроек = Неопределено,
                                             знач ОписаниеНастроек = Неопределено,
                                             знач ИдентификаторПользователя = Неопределено) Экспорт
											 
											 УстановитьПривилегированныйРежим(Истина);
											 Результат = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, ИдентификаторПользователя);
											 УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Удалить сохраненное значение ввода
Функция УдалитьЗначениеИзИсторииВводаХранилища(Идентификатор,Значение)Экспорт
	
	МассивВведенныхЗначений = ПолучитьНастройкуСистемногоХранилища(Идентификатор,"МеханизмСохраненияПоследнихВыбранныхЗначений");
	
	Если МассивВведенныхЗначений = Неопределено Тогда
		МассивВведенныхЗначений = Новый Массив;
	КонецЕсли;
	
	Для Индекс = 0 по МассивВведенныхЗначений.ВГраница() Цикл
		Если МассивВведенныхЗначений.Получить(Индекс) = Значение Тогда
			МассивВведенныхЗначений.Удалить(Индекс);
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Пока МассивВведенныхЗначений.Количество() > 15 Цикл
		МассивВведенныхЗначений.Удалить(МассивВведенныхЗначений.ВГраница());
	КонецЦикла;
	
	СохранитьНастройкуСистемногоХранилища(Идентификатор, МассивВведенныхЗначений, "МеханизмСохраненияПоследнихВыбранныхЗначений");

КонецФункции

// Удалить сохраненное значение ввода
Функция УдалаитьЗначениеИзИсторииВвода(Идентификатор,Значение)Экспорт
	
	МассивВведенныхЗначений = ПолучитьНастройкуСистемногоХранилища(Идентификатор,"МеханизмСохраненияПоследнихВыбранныхЗначений");
	
	Если МассивВведенныхЗначений = Неопределено Тогда
		МассивВведенныхЗначений = Новый Массив;
	КонецЕсли;
	
	Для Индекс = 0 по МассивВведенныхЗначений.ВГраница() Цикл
		Если МассивВведенныхЗначений.Получить(Индекс) = Значение Тогда
			МассивВведенныхЗначений.Удалить(Индекс);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Идентификатор = "ОбщаяФорма.РедактированиеНовогоПисьма.ЭлектронныйАдресКому"  Тогда 
		Сч = 5;
	Иначе
		Сч = 15;
	КонецЕсли;	
	Пока МассивВведенныхЗначений.Количество() > Сч Цикл
		МассивВведенныхЗначений.Удалить(МассивВведенныхЗначений.ВГраница());
	КонецЦикла;
	
	СохранитьНастройкуСистемногоХранилища(Идентификатор, МассивВведенныхЗначений, "МеханизмСохраненияПоследнихВыбранныхЗначений");

КонецФункции

  #КонецОбласти
